
&НаСервере
Процедура УдалитьНЕУТНаСервере()
	
	Сообщить("Старт: = " + ТекущаяДата());
	
	НайденныеФайлы = НайтиФайлы(КаталогФайлов, "*.txt");
	НайденныеФайлыХМЛ = НайтиФайлы(КаталогФайлов, "*.Template.xml");
	Для Каждого ФайлХМЛ Из НайденныеФайлыХМЛ Цикл
		НайденныеФайлы.Добавить(ФайлХМЛ);
	КонецЦикла;
	
	КоличествоОбработанныхФайлов = 0;
	
	Для Каждого Файл Из НайденныеФайлы Цикл
		
		ФайлИзменен = Ложь;
		
		Текст = Новый ТекстовыйДокумент;
		Текст.Прочитать(Файл.ПолноеИмя);
		
		ВырезатьФрагменты(Текст,ФайлИзменен,"НЕ УТКА");
		ВырезатьФрагменты(Текст,ФайлИзменен,"НЕ УТ");
		ВырезатьФрагменты(Текст,ФайлИзменен,"НЕУКР");
		
		Если ФайлИзменен  Тогда
			Текст.Записать(Файл.ПолноеИмя);
			КоличествоОбработанныхФайлов = КоличествоОбработанныхФайлов + 1;
	    КонецЕсли; 
		
	КонецЦикла;
	
	Сообщить("Финиш = " + ТекущаяДата()+" 
	        | Обработано "+КоличествоОбработанныхФайлов+" файлов из "+НайденныеФайлы.Количество());
КонецПроцедуры

&НаКлиенте
Процедура УдалитьНЕУТ(Команда)
	УдалитьНЕУТНаСервере();
КонецПроцедуры



Процедура ВырезатьФрагменты(Текст,ФайлИзменен,Фрагмент = "НЕ УТ")
	
	//В отладочном режиме только комментируем.
	УдалятьКомментарии = Ложь;
	
	
	КолвоСтрок = Текст.КоличествоСтрок();
	
	МассивСтрокДляУдаления = Новый Массив;
	
	Для Инд = 1 По КолвоСтрок Цикл
		
		Стр = Текст.ПолучитьСтроку(Инд);
		
		Если СтрНачинаетсяС(СокрЛ(Стр), "//++ "+Фрагмент) > 0 Тогда
			Пока Инд <= КолвоСтрок Цикл
				МассивСтрокДляУдаления.Вставить(0, Инд);
				Если СтрНачинаетсяС(СокрЛ(Стр), "//-- "+Фрагмент) > 0 Тогда
					Прервать;
				КонецЕсли; 
				Инд = Инд + 1;
				Стр = Текст.ПолучитьСтроку(Инд);
			КонецЦикла;
			ФайлИзменен = Истина;
			Продолжить;
		КонецЕсли; 
		
		СтрРезультат = Стр;
	КонецЦикла;	
	
	Для Каждого ИндексСтроки Из МассивСтрокДляУдаления Цикл
		Если УдалятьКомментарии Тогда
			Текст.УдалитьСтроку(ИндексСтроки);
		Иначе
			Стр = Текст.ПолучитьСтроку(ИндексСтроки);
			Стр = "//^ "+Фрагмент+Стр;
			Текст.ЗаменитьСтроку(ИндексСтроки, Стр);
		КонецЕсли; 
	КонецЦикла;
	
	
	
КонецПроцедуры // ОбработатьНЕУКР

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СтрНайти(ПараметрЗапуска,"UpdateTextFiles") > 0 Тогда
		
		СтруктураПараметров = ПолучитьПараметрыИзСтроки(ПараметрЗапуска);
	
		Если СтруктураПараметров.Свойство("FilesCatalog") Тогда
			КаталогФайлов = СтруктураПараметров.FilesCatalog;
		КонецЕсли;
				
		УдалитьНЕУТНаСервере();

		ЗавершитьРаботуСистемы(Ложь);
		
	КонецЕсли; 
	
КонецПроцедуры


// Получает значения параметров из строки.
//
// Параметры:
//  СтрокаПараметров - Строка - строка, содержащая параметры, каждый из которых представляет собой
//                              фрагмент вида <Имя параметра>=<Значение>, где:
//                                Имя параметра - имя параметра; 
//                                Значение - его значение. 
//                              Фрагменты отделяются друг от друга символами ';'.
//                              Если значение содержит пробельные символы, то оно должно быть заключено в двойные
//                              кавычки (").
//                              Например:
//                               "File=""c:\InfoBases\Trade""; Usr=""Director"";"
//  Разделитель - Строка - символ, которым фрагменты отделяются друг от друга.
//
// Возвращаемое значение:
//  Структура - структура параметров, где ключ - имя параметра, значение - значение параметра.
//
Функция ПолучитьПараметрыИзСтроки(Знач СтрокаПараметров, Знач Разделитель = ";") Экспорт
	
	Результат = Новый Структура;
	
	СимволДвойныеКавычки = Символ(34); // (")
	
	МассивПодстрок = СтрРазделить(СтрокаПараметров, Разделитель, Ложь);
	
	Для Каждого СтрокаПараметра Из МассивПодстрок Цикл
		
		ПозицияПервогоЗнакаРавенства = СтрНайти(СтрокаПараметра, "=");
		
		// Получаем имя параметра
		ИмяПараметра = СокрЛП(Лев(СтрокаПараметра, ПозицияПервогоЗнакаРавенства - 1));
		
		// Получаем значение параметра.
		ЗначениеПараметра = СокрЛП(Сред(СтрокаПараметра, ПозицияПервогоЗнакаРавенства + 1));
		
		Если СтрНачинаетсяС(ЗначениеПараметра, СимволДвойныеКавычки)
			И СтрЗаканчиваетсяНа(ЗначениеПараметра, СимволДвойныеКавычки) Тогда
			
			ЗначениеПараметра = Сред(ЗначениеПараметра, 2, СтрДлина(ЗначениеПараметра) - 2);
			
		КонецЕсли;
		
		Если Не ПустаяСтрока(ИмяПараметра) Тогда
			
			Результат.Вставить(ИмяПараметра, ЗначениеПараметра);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
КонецФункции



